OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1784.h
extern __at(0x0119) volatile __DACCON1bits_t DACCON1bits;

#define _DACR0                  0x01
#define _DACR1                  0x02
#define _DACR2                  0x04
#define _DACR3                  0x08
#define _DACR4                  0x10
#define _DACR5                  0x20
#define _DACR6                  0x40
#define _DACR7                  0x80

//==============================================================================


//==============================================================================
//        CM4CON0 Bits

extern __at(0x011A) __sfr CM4CON0;

typedef struct
  {
  unsigned C4SYNC               : 1;
  unsigned C4HYS                : 1;
  unsigned C4SP                 : 1;
  unsigned C4ZLF                : 1;
  unsigned C4POL                : 1;
  unsigned C4OE                 : 1;
  unsigned C4OUT                : 1;
  unsigned C4ON                 : 1;
  } __CM4CON0bits_t;

extern __at(0x011A) volatile __CM4CON0bits_t CM4CON0bits;

#define _C4SYNC                 0x01
#define _C4HYS                  0x02
#define _C4SP                   0x04
#define _C4ZLF                  0x08
#define _C4POL                  0x10
#define _C4OE                   0x20
#define _C4OUT                  0x40
#define _C4ON                   0x80

//==============================================================================


//==============================================================================
//        CM4CON1 Bits

extern __at(0x011B) __sfr CM4CON1;

typedef union
  {
  struct
    {
    unsigned C4NCH0             : 1;
    unsigned C4NCH1             : 1;
    unsigned C4NCH2             : 1;
    unsigned C4PCH0             : 1;
    unsigned C4PCH1             : 1;
    unsigned C4PCH2             : 1;
    unsigned C4INTN             : 1;
    unsigned C4INTP             : 1;
    };

  struct
    {
    unsigned C4NCH              : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned                    : 3;
    unsigned C4PCH              : 3;
    unsigned                    : 2;
    };
  } __CM4CON1bits_t;

extern __at(0x011B) volatile __CM4CON1bits_t CM4CON1bits;

#define _C4NCH0                 0x01
#define _C4NCH1                 0x02
#define _C4NCH2                 0x04
#define _C4PCH0                 0x08
#define _C4PCH1                 0x10
#define _C4PCH2                 0x20
#define _C4INTN                 0x40
#define _C4INTP                 0x80

//==============================================================================


//==============================================================================
//        APFCON2 Bits

extern __at(0x011C) __sfr APFCON2;

typedef struct
  {
  unsigned CCP3SEL              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __APFCON2bits_t;

extern __at(0x011C) volatile __APFCON2bits_t APFCON2bits;

#define _CCP3SEL                0x01

//==============================================================================


//==============================================================================
//        APFCON Bits

extern __at(0x011D) __sfr APFCON;

typedef struct
  {
  unsigned CCP2SEL              : 1;
  unsigned RXSEL                : 1;
  unsigned TXSEL                : 1;
  unsigned SDISEL               : 1;
  unsigned SCKSEL               : 1;
  unsigned SDOSEL               : 1;
  unsigned CCP1SEL              : 1;
  unsigned C2OUTSEL             : 1;
  } __APFCONbits_t;

extern __at(0x011D) volatile __APFCONbits_t APFCONbits;

#define _CCP2SEL                0x01
#define _RXSEL                  0x02
#define _TXSEL                  0x04
#define _SDISEL                 0x08
#define _SCKSEL                 0x10
#define _SDOSEL                 0x20
#define _CCP1SEL                0x40
#define _C2OUTSEL               0x80

//==============================================================================


//==============================================================================
//        APFCON0 Bits

extern __at(0x011D) __sfr APFCON0;

typedef struct
  {
  unsigned CCP2SEL              : 1;
  unsigned RXSEL                : 1;
  unsigned TXSEL                : 1;
  unsigned SDISEL               : 1;
  unsigned SCKSEL               : 1;
  unsigned SDOSEL               : 1;
  unsigned CCP1SEL              : 1;
  unsigned C2OUTSEL             : 1;
  } __APFCON0bits_t;

extern __at(0x011D) volatile __APFCON0bits_t APFCON0bits;

#define _APFCON0_CCP2SEL        0x01
#define _APFCON0_RXSEL          0x02
#define _APFCON0_TXSEL          0x04
#define _APFCON0_SDISEL         0x08
#define _APFCON0_SCKSEL         0x10
#define _APFCON0_SDOSEL         0x20
#define _APFCON0_CCP1SEL        0x40
#define _APFCON0_C2OUTSEL       0x80

//==============================================================================


//==============================================================================
//        APFCON1 Bits

extern __at(0x011D) __sfr APFCON1;

typedef struct
  {
  unsigned CCP2SEL              : 1;
  unsigned RXSEL                : 1;
  unsigned TXSEL                : 1;
  unsigned SDISEL               : 1;
  unsigned SCKSEL               : 1;
  unsigned SDOSEL               : 1;
  unsigned CCP1SEL              : 1;
  unsigned C2OUTSEL             : 1;
  } __APFCON1bits_t;

extern __at(0x011D) volatile __APFCON1bits_t APFCON1bits;

#define _APFCON1_CCP2SEL        0x01
#define _APFCON1_RXSEL          0x02
#define _APFCON1_TXSEL          0x04
#define _APFCON1_SDISEL         0x08
#define _APFCON1_SCKSEL         0x10
#define _APFCON1_SDOSEL         0x20
#define _APFCON1_CCP1SEL        0x40
#define _APFCON1_C2OUTSEL       0x80

//==============================================================================


//==============================================================================
//        CM3CON0 Bits

