OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1784.h
#define _P2REBSC1               0x02
#define _P2REBSC2               0x04
#define _P2REBSC3               0x08
#define _P2REBSC4               0x10
#define _P2REBSIN               0x80

//==============================================================================


//==============================================================================
//        PSMC2FEBS Bits

extern __at(0x0839) __sfr PSMC2FEBS;

typedef struct
  {
  unsigned                      : 1;
  unsigned P2FEBSC1             : 1;
  unsigned P2FEBSC2             : 1;
  unsigned P2FEBSC3             : 1;
  unsigned P2FEBSC4             : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P2FEBSIN             : 1;
  } __PSMC2FEBSbits_t;

extern __at(0x0839) volatile __PSMC2FEBSbits_t PSMC2FEBSbits;

#define _P2FEBSC1               0x02
#define _P2FEBSC2               0x04
#define _P2FEBSC3               0x08
#define _P2FEBSC4               0x10
#define _P2FEBSIN               0x80

//==============================================================================


//==============================================================================
//        PSMC2PHS Bits

extern __at(0x083A) __sfr PSMC2PHS;

typedef struct
  {
  unsigned P2PHST               : 1;
  unsigned P2PHSC1              : 1;
  unsigned P2PHSC2              : 1;
  unsigned P2PHSC3              : 1;
  unsigned P2PHSC4              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P2PHSIN              : 1;
  } __PSMC2PHSbits_t;

extern __at(0x083A) volatile __PSMC2PHSbits_t PSMC2PHSbits;

#define _P2PHST                 0x01
#define _P2PHSC1                0x02
#define _P2PHSC2                0x04
#define _P2PHSC3                0x08
#define _P2PHSC4                0x10
#define _P2PHSIN                0x80

//==============================================================================


//==============================================================================
//        PSMC2DCS Bits

extern __at(0x083B) __sfr PSMC2DCS;

typedef struct
  {
  unsigned P2DCST               : 1;
  unsigned P2DCSC1              : 1;
  unsigned P2DCSC2              : 1;
  unsigned P2DCSC3              : 1;
  unsigned P2DCSC4              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P2DCSIN              : 1;
  } __PSMC2DCSbits_t;

extern __at(0x083B) volatile __PSMC2DCSbits_t PSMC2DCSbits;

#define _P2DCST                 0x01
#define _P2DCSC1                0x02
#define _P2DCSC2                0x04
#define _P2DCSC3                0x08
#define _P2DCSC4                0x10
#define _P2DCSIN                0x80

//==============================================================================


//==============================================================================
//        PSMC2PRS Bits

extern __at(0x083C) __sfr PSMC2PRS;

typedef struct
  {
  unsigned P2PRST               : 1;
  unsigned P2PRSC1              : 1;
  unsigned P2PRSC2              : 1;
  unsigned P2PRSC3              : 1;
  unsigned P2PRSC4              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P2PRSIN              : 1;
  } __PSMC2PRSbits_t;

extern __at(0x083C) volatile __PSMC2PRSbits_t PSMC2PRSbits;

#define _P2PRST                 0x01
#define _P2PRSC1                0x02
#define _P2PRSC2                0x04
#define _P2PRSC3                0x08
#define _P2PRSC4                0x10
#define _P2PRSIN                0x80

//==============================================================================


//==============================================================================
//        PSMC2ASDC Bits

extern __at(0x083D) __sfr PSMC2ASDC;

typedef struct
  {
  unsigned P2ASDOV              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P2ARSEN              : 1;
  unsigned P2ASDEN              : 1;
  unsigned P2ASE                : 1;
  } __PSMC2ASDCbits_t;

extern __at(0x083D) volatile __PSMC2ASDCbits_t PSMC2ASDCbits;

#define _P2ASDOV                0x01
#define _P2ARSEN                0x20
#define _P2ASDEN                0x40
#define _P2ASE                  0x80

//==============================================================================


//==============================================================================
//        PSMC2ASDL Bits

extern __at(0x083E) __sfr PSMC2ASDL;

typedef struct
  {
  unsigned P2ASDLA              : 1;
  unsigned P2ASDLB              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PSMC2ASDLbits_t;

extern __at(0x083E) volatile __PSMC2ASDLbits_t PSMC2ASDLbits;

#define _P2ASDLA                0x01
#define _P2ASDLB                0x02

//==============================================================================


//==============================================================================
//        PSMC2ASDS Bits

extern __at(0x083F) __sfr PSMC2ASDS;

typedef struct
  {
  unsigned                      : 1;
  unsigned P2ASDSC1             : 1;
  unsigned P2ASDSC2             : 1;
  unsigned P2ASDSC3             : 1;
  unsigned P2ASDSC4             : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P2ASDSIN             : 1;
  } __PSMC2ASDSbits_t;

extern __at(0x083F) volatile __PSMC2ASDSbits_t PSMC2ASDSbits;

#define _P2ASDSC1               0x02
#define _P2ASDSC2               0x04
#define _P2ASDSC3               0x08
#define _P2ASDSC4               0x10
#define _P2ASDSIN               0x80

//==============================================================================


//==============================================================================
//        PSMC2INT Bits

extern __at(0x0840) __sfr PSMC2INT;

typedef struct
  {
  unsigned P2TPRIF              : 1;
  unsigned P2TDCIF              : 1;
  unsigned P2TPHIF              : 1;
  unsigned P2TOVIF              : 1;
  unsigned P2TPRIE              : 1;
  unsigned P2TDCIE              : 1;
  unsigned P2TPHIE              : 1;
  unsigned P2TOVIE              : 1;
  } __PSMC2INTbits_t;

extern __at(0x0840) volatile __PSMC2INTbits_t PSMC2INTbits;

#define _P2TPRIF                0x01
#define _P2TDCIF                0x02
#define _P2TPHIF                0x04
#define _P2TOVIF                0x08
#define _P2TPRIE                0x10
#define _P2TDCIE                0x20
#define _P2TPHIE                0x40
#define _P2TOVIE                0x80

//==============================================================================

extern __at(0x0841) __sfr PSMC2PH;

//==============================================================================
//        PSMC2PHL Bits

extern __at(0x0841) __sfr PSMC2PHL;

typedef struct
  {
  unsigned PSMC2PH0             : 1;
  unsigned PSMC2PH1             : 1;
  unsigned PSMC2PH2             : 1;
  unsigned PSMC2PH3             : 1;
  unsigned PSMC2PH4             : 1;
  unsigned PSMC2PH5             : 1;
  unsigned PSMC2PH6             : 1;
  unsigned PSMC2PH7             : 1;
  } __PSMC2PHLbits_t;

extern __at(0x0841) volatile __PSMC2PHLbits_t PSMC2PHLbits;

#define _PSMC2PH0               0x01
#define _PSMC2PH1               0x02
#define _PSMC2PH2               0x04
#define _PSMC2PH3               0x08
#define _PSMC2PH4               0x10
#define _PSMC2PH5               0x20
#define _PSMC2PH6               0x40
#define _PSMC2PH7               0x80

//==============================================================================


//==============================================================================
//        PSMC2PHH Bits

