OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1784.h
#define _PSMC3PR8               0x01
#define _PSMC3PR9               0x02
#define _PSMC3PR10              0x04
#define _PSMC3PR11              0x08
#define _PSMC3PR12              0x10
#define _PSMC3PR13              0x20
#define _PSMC3PR14              0x40
#define _PSMC3PR15              0x80

//==============================================================================

extern __at(0x0867) __sfr PSMC3TMR;

//==============================================================================
//        PSMC3TMRL Bits

extern __at(0x0867) __sfr PSMC3TMRL;

typedef struct
  {
  unsigned PSMC3TMR0            : 1;
  unsigned PSMC3TMR1            : 1;
  unsigned PSMC3TMR2            : 1;
  unsigned PSMC3TMR3            : 1;
  unsigned PSMC3TMR4            : 1;
  unsigned PSMC3TMR5            : 1;
  unsigned PSMC3TMR6            : 1;
  unsigned PSMC3TMR7            : 1;
  } __PSMC3TMRLbits_t;

extern __at(0x0867) volatile __PSMC3TMRLbits_t PSMC3TMRLbits;

#define _PSMC3TMR0              0x01
#define _PSMC3TMR1              0x02
#define _PSMC3TMR2              0x04
#define _PSMC3TMR3              0x08
#define _PSMC3TMR4              0x10
#define _PSMC3TMR5              0x20
#define _PSMC3TMR6              0x40
#define _PSMC3TMR7              0x80

//==============================================================================


//==============================================================================
//        PSMC3TMRH Bits

extern __at(0x0868) __sfr PSMC3TMRH;

typedef struct
  {
  unsigned PSMC3TMR8            : 1;
  unsigned PSMC3TMR9            : 1;
  unsigned PSMC3TMR10           : 1;
  unsigned PSMC3TMR11           : 1;
  unsigned PSMC3TMR12           : 1;
  unsigned PSMC3TMR13           : 1;
  unsigned PSMC3TMR14           : 1;
  unsigned PSMC3TMR15           : 1;
  } __PSMC3TMRHbits_t;

extern __at(0x0868) volatile __PSMC3TMRHbits_t PSMC3TMRHbits;

#define _PSMC3TMR8              0x01
#define _PSMC3TMR9              0x02
#define _PSMC3TMR10             0x04
#define _PSMC3TMR11             0x08
#define _PSMC3TMR12             0x10
#define _PSMC3TMR13             0x20
#define _PSMC3TMR14             0x40
#define _PSMC3TMR15             0x80

//==============================================================================


//==============================================================================
//        PSMC3DBR Bits

extern __at(0x0869) __sfr PSMC3DBR;

typedef struct
  {
  unsigned PSMC3DBR0            : 1;
  unsigned PSMC3DBR1            : 1;
  unsigned PSMC3DBR2            : 1;
  unsigned PSMC3DBR3            : 1;
  unsigned PSMC3DBR4            : 1;
  unsigned PSMC3DBR5            : 1;
  unsigned PSMC3DBR6            : 1;
  unsigned PSMC3DBR7            : 1;
  } __PSMC3DBRbits_t;

extern __at(0x0869) volatile __PSMC3DBRbits_t PSMC3DBRbits;

#define _PSMC3DBR0              0x01
#define _PSMC3DBR1              0x02
#define _PSMC3DBR2              0x04
#define _PSMC3DBR3              0x08
#define _PSMC3DBR4              0x10
#define _PSMC3DBR5              0x20
#define _PSMC3DBR6              0x40
#define _PSMC3DBR7              0x80

//==============================================================================


//==============================================================================
//        PSMC3DBF Bits

extern __at(0x086A) __sfr PSMC3DBF;

typedef struct
  {
  unsigned PSMC3DBF0            : 1;
  unsigned PSMC3DBF1            : 1;
  unsigned PSMC3DBF2            : 1;
  unsigned PSMC3DBF3            : 1;
  unsigned PSMC3DBF4            : 1;
  unsigned PSMC3DBF5            : 1;
  unsigned PSMC3DBF6            : 1;
  unsigned PSMC3DBF7            : 1;
  } __PSMC3DBFbits_t;

extern __at(0x086A) volatile __PSMC3DBFbits_t PSMC3DBFbits;

#define _PSMC3DBF0              0x01
#define _PSMC3DBF1              0x02
#define _PSMC3DBF2              0x04
#define _PSMC3DBF3              0x08
#define _PSMC3DBF4              0x10
#define _PSMC3DBF5              0x20
#define _PSMC3DBF6              0x40
#define _PSMC3DBF7              0x80

//==============================================================================


//==============================================================================
//        PSMC3BLKR Bits

extern __at(0x086B) __sfr PSMC3BLKR;

typedef struct
  {
  unsigned PSMC3BLKR0           : 1;
  unsigned PSMC3BLKR1           : 1;
  unsigned PSMC3BLKR2           : 1;
  unsigned PSMC3BLKR3           : 1;
  unsigned PSMC3BLKR4           : 1;
  unsigned PSMC3BLKR5           : 1;
  unsigned PSMC3BLKR6           : 1;
  unsigned PSMC3BLKR7           : 1;
  } __PSMC3BLKRbits_t;

extern __at(0x086B) volatile __PSMC3BLKRbits_t PSMC3BLKRbits;

#define _PSMC3BLKR0             0x01
#define _PSMC3BLKR1             0x02
#define _PSMC3BLKR2             0x04
#define _PSMC3BLKR3             0x08
#define _PSMC3BLKR4             0x10
#define _PSMC3BLKR5             0x20
#define _PSMC3BLKR6             0x40
#define _PSMC3BLKR7             0x80

//==============================================================================


//==============================================================================
//        PSMC3BLKF Bits

extern __at(0x086C) __sfr PSMC3BLKF;

typedef struct
  {
  unsigned PSMC3BLKF0           : 1;
  unsigned PSMC3BLKF1           : 1;
  unsigned PSMC3BLKF2           : 1;
  unsigned PSMC3BLKF3           : 1;
  unsigned PSMC3BLKF4           : 1;
  unsigned PSMC3BLKF5           : 1;
  unsigned PSMC3BLKF6           : 1;
  unsigned PSMC3BLKF7           : 1;
  } __PSMC3BLKFbits_t;

extern __at(0x086C) volatile __PSMC3BLKFbits_t PSMC3BLKFbits;

#define _PSMC3BLKF0             0x01
#define _PSMC3BLKF1             0x02
#define _PSMC3BLKF2             0x04
#define _PSMC3BLKF3             0x08
#define _PSMC3BLKF4             0x10
#define _PSMC3BLKF5             0x20
#define _PSMC3BLKF6             0x40
#define _PSMC3BLKF7             0x80

//==============================================================================


//==============================================================================
//        PSMC3FFA Bits

